## Список
str = 'AaBbCcDd'   # Сохраняем строку
upper_str = str[::2]   # Получаем строку с заглавными буквами (с шагом 2, начиная с 0 индекса)
lower_str = str[1::2]  # Получаем строку со строчными буквами (с шагом 2, начиная с 1 индекса)
  # Выводим результаты
print("Заглавные буквы:", upper_str)
print("Строчные буквы:", lower_str)



## Стек
stack = []   # Создание пустого списка, который будет использоваться как стек
stack.append('a')   # Добавление элемента 'a' 
stack.append('b')   # Добавление элемента 'b' 
stack.append('c')   # Добавление элемента 'c' 
print(stack)  

